Merge pull request #77 from AIappsGBBFactory/staging
docs updates and more pipeline related fixes/enhancements
